app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("message", "amount", "payment_status", "recipient_url", "recipient_name", "recipient_img", "wallet_address", "qr_image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)
    # @transaction = @current_user.transactions.new(transaction_params)

    if @transaction.save

UPDATE "transactions" SET "payment_status" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["payment_status", "recieved"], ["updated_at", 2017-02-18 11:43:14 UTC], ["id", 1]]
---
  def update
    if @transaction.update(transaction_params)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."wallet_address" = $1 ORDER BY "transactions"."id" DESC LIMIT $2  [["wallet_address", "2NAJBXKvs5HLemhFGy5yL1BtqME4bPD6tdE"], ["LIMIT", 1]]
UPDATE "transactions" SET "payment_status" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["payment_status", "complete"], ["updated_at", 2017-02-22 14:20:30 UTC], ["id", 1]]
---
  def webhook
    wallet_address = params[:data][:address]
    p wallet_address
    @transaction = Transaction.where(wallet_address: wallet_address).last
    if @transaction
      @transaction.update!(payment_status: "complete")